Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_MBEDTLS/cy_wps_aes_ctr_ccm.c
        data_input += AES_BLOCK_SZ;
        mbedtls_aes_crypt_ecb( ctx, MBEDTLS_AES_ENCRYPT, X, X );
    }

    /* Last block may be partial, padding is implicit in this xor */
    for ( k = 0; k < ( length % AES_BLOCK_SZ ); k++ )
    {
        X[k] ^= *data_input++;
    }

    if ( length % AES_BLOCK_SZ )
    {
        mbedtls_aes_crypt_ecb( ctx, MBEDTLS_AES_ENCRYPT, X, X );
    }

    /* T := first-M-bytes( X_n+1 ) */
    memcpy( mac_output, X, AES_CCM_AUTH_LEN );

    return ( 0 );
}

/* AES-CCM mode encryption
 *    - computes AES_CCM_AUTH_LEN MAC and then encrypts ptxt and MAC
 *    - nonce must be AES_CCM_NONCE_LEN bytes
 *    - ctxt must have sufficient tailroom for CCM MAC
 *    - ptxt and ctxt can point to the same location
 *    - returns -1 on error
 */
int aes_encrypt_ccm( mbedtls_aes_context *ctx, uint32_t length, uint32_t aad_length, const unsigned char *nonce, uint8_t nonce_len, const unsigned char *aad_input, const unsigned char *plaintext_input, unsigned char *ciphertext_output, unsigned char mac_output[8] )
{
    unsigned char A[AES_BLOCK_SZ], X[AES_BLOCK_SZ];

    /* Initialize counter */
    A[0] = AES_CCM_CRYPT_FLAGS(nonce_len);

    memcpy( &A[1], nonce, nonce_len );
    memset( A + 1 + nonce_len, 0, AES_CCM_NONCE_LEN - nonce_len );

    /* Calculate and encrypt MAC */
    if (aes_ccm_mac( ctx, length, aad_length, nonce, nonce_len, aad_input, plaintext_input, X))
    {
        return (-1);
    }
    if (aes_crypt_ctr( ctx, AES_CCM_AUTH_LEN, A, X, X ))
    {
        return (-1);
    }
    memcpy( mac_output, X, AES_CCM_AUTH_LEN );

    /* Encrypt data */
    A[AES_BLOCK_SZ - 1] = 1;
    if (aes_crypt_ctr( ctx, length, A, plaintext_input, ciphertext_output ))
    {
        return (-1);
    }

    return (0);
}

/* AES-CCM mode decryption
 *    - decrypts ctxt, then computes AES_CCM_AUTH_LEN MAC and checks it against
 *      then decrypted MAC
 *    - the decrypted MAC is included in ptxt
 *    - nonce must be AES_CCM_NONCE_LEN bytes
 *    - ptxt and ctxt can point to the same location
 *    - returns -1 on error
 */
int aes_decrypt_ccm( mbedtls_aes_context *ctx, uint32_t length, uint32_t aad_length,const unsigned char *nonce, uint8_t nonce_len, const unsigned char *aad_input, const unsigned char *ciphertext_input, unsigned char *plaintext_output )
{
    unsigned char A[AES_BLOCK_SZ];
    unsigned char X[AES_BLOCK_SZ];

    /* Initialize counter */
    A[0] = AES_CCM_CRYPT_FLAGS(nonce_len);
    memcpy( &A[1], nonce, nonce_len );
    memset( A + 1 + nonce_len, 0, AES_CCM_NONCE_LEN - nonce_len );
    A[AES_BLOCK_SZ - 1] = 1;

    /* Decrypt data */
    if ( aes_crypt_ctr( ctx, length - AES_CCM_AUTH_LEN, A, ciphertext_input, plaintext_output ) )
    {
        return ( -1 );
    }

    /* Decrypt MAC */
    memset( A + 1 + nonce_len, 0, AES_CCM_NONCE_LEN - nonce_len );

    if ( aes_crypt_ctr( ctx, AES_CCM_AUTH_LEN, A, ciphertext_input + length - AES_CCM_AUTH_LEN, plaintext_output + length - AES_CCM_AUTH_LEN ) )
    {
        return ( -1 );
    }

    /* Calculate MAC */
    if ( aes_ccm_mac( ctx, length - AES_CCM_AUTH_LEN, aad_length, nonce, nonce_len,aad_input, plaintext_output, X ) )
    {
        return ( -1 );
    }

    if ( memcmp(X, plaintext_output + length - AES_CCM_AUTH_LEN, AES_CCM_AUTH_LEN) != 0 )
    {
        return ( -1 );
    }

    return ( 0 );
}

/* AES-CBC mode encryption/decryption algorithm with padding
 *    - handle partial plaintext blocks with padding
 *    - ptxt and ctxt can point to the same location
 *    - returns -1 on error
 */
int aes_cbc_crypt_pad_length_padding( mbedtls_aes_context *ctx, int mode, uint32_t length, const unsigned char iv[16], const unsigned char *input, unsigned char *output )
{
    int remaining = length & 0x0f;
    uint32_t rounded_length = length & 0xfffffff0;
    unsigned char iv_copy[16];

    if ( length == 0 )
    {
        return -1;
    }

    if ( ( mode == MBEDTLS_AES_DECRYPT ) && ( remaining != 0 ) )
    {
        return -1;
    }

    memcpy( iv_copy, iv, sizeof(iv_copy) );

    mbedtls_aes_crypt_cbc( ctx, mode, rounded_length, iv_copy, input, output );

    if ( mode == MBEDTLS_AES_DECRYPT )
    {
        return (int)(length - output[length - 1]);
    }
    else
    {
        int j;
        uint8_t tmp[AES_BLOCK_SZ];

        for (j = 0; j < remaining; j++)
        {
            tmp[j] = (uint8_t)(input[(int)rounded_length + j] ^ iv_copy[j]);
        }

        for (j = remaining; j < AES_BLOCK_SZ; j++)
        {
            tmp[j] = (uint8_t)(AES_BLOCK_SZ - remaining) ^  iv_copy[j];
        }

        mbedtls_aes_crypt_ecb( ctx, mode, tmp, output + rounded_length );

        return (int)(rounded_length + AES_BLOCK_SZ);
    }
}

#if defined(AES_SELF_TEST)

#include <stdio.h>

#include <unit/aes_vectors.h>

#define TESTBUF    2048

/*
 * Checkup routine
 */
static uint8_t aes_padded_ccm_output[TESTBUF], aes_padded_ccm_input2[TESTBUF];

int32_t aes_padded_ccm_ctr_self_test(int32_t verbose)
{
    /* AES-CBC padded */
    {
        uint32_t k;
        mbedtls_aes_context ctx;

        for (k = 0; k < NUM_CBC_VECTORS; k++)
        {

            int retv;


            if( verbose != 0 )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "padded AES CBC Encrypt: %d bytes\n", aes_cbc_vec[k].il);
            }

            mbedtls_aes_init( &ctx );
            mbedtls_aes_setkey_enc( &ctx, aes_cbc_vec[k].key, (uint32_t)( aes_cbc_vec[k].kl * 8 ) );
            retv = aes_cbc_crypt_pad_length_padding( &ctx, MBEDTLS_AES_ENCRYPT, (uint32_t)( aes_cbc_vec[k].il ),
                                                     aes_cbc_vec[k].nonce, aes_cbc_vec[k].input, aes_padded_ccm_output );
            if ( (uint32_t)retv != cbc_padded_ref[k].length)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: pad aes_cbc_encrypt length failed\n", __FUNCTION__);
                }
                return 1;
            }
            if (memcmp(cbc_padded_ref[k].ref, aes_padded_ccm_output, cbc_padded_ref[k].length) != 0)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: pad aes_cbc_encrypt data failed\n", __FUNCTION__);
                }
                return 1;
            }


