Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_MBEDTLS/cy_wps_aes_ctr_ccm.c
            if( verbose != 0 )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "padded AES CBC Decrypt: %d bytes\n", aes_cbc_vec[k].il);
            }

            mbedtls_aes_setkey_dec( &ctx, aes_cbc_vec[k].key, (uint32_t)( aes_cbc_vec[k].kl * 8 ) );

            retv = aes_cbc_crypt_pad_length_padding( &ctx, AES_DECRYPT, cbc_padded_ref[k].length,
                                                     aes_cbc_vec[k].nonce, cbc_padded_ref[k].ref, aes_padded_ccm_output );

            if ( (uint32_t)retv != aes_cbc_vec[k].il )
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: pad aes_cbc_decrypt length failed %d\n", __FUNCTION__, retv);
                }
                return 1;
            }
            if ( memcmp( aes_cbc_vec[k].input, aes_padded_ccm_output, (size_t) aes_cbc_vec[k].il ) != 0 )
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: pad aes_cbc_decrypt data failed\n", __FUNCTION__);
                }
                return 1;
            }

            if( verbose != 0 )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "short padded AES CBC Encrypt: %d bytes\n", aes_cbc_vec[k].il - 1);
            }

            mbedtls_aes_setkey_enc( &ctx, aes_cbc_vec[k].key, (uint32_t)( aes_cbc_vec[k].kl * 8 ) );
            retv = aes_cbc_crypt_pad_length_padding( &ctx, AES_ENCRYPT, (uint32_t)( aes_cbc_vec[k].il - 1 ),
                                                     aes_cbc_vec[k].nonce, aes_cbc_vec[k].input, aes_padded_ccm_output );

            if ( (uint32_t)retv != cbc_short_padded_ref[k].length )
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: short pad aes_cbc_encrypt length failed\n", __FUNCTION__);
                }
                return 1;
            }
            if ( memcmp( cbc_short_padded_ref[k].ref, aes_padded_ccm_output, cbc_short_padded_ref[k].length ) != 0 )
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: short pad aes_cbc_encrypt data failed\n", __FUNCTION__);
                }
                return 1;
            }

            if( verbose != 0 )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "short padded AES CBC Decrypt: %d bytes\n", aes_cbc_vec[k].il - 1);
            }

            mbedtls_aes_setkey_dec( &ctx, aes_cbc_vec[k].key, (uint32_t)( aes_cbc_vec[k].kl * 8 ) );

            retv = aes_cbc_crypt_pad_length_padding( &ctx, MBEDTLS_AES_DECRYPT, cbc_short_padded_ref[k].length,
                                                     aes_cbc_vec[k].nonce, cbc_short_padded_ref[k].ref, aes_padded_ccm_output );

            if ( (uint32_t)retv != aes_cbc_vec[k].il - 1 )
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: short pad aes_cbc_decrypt length failed\n", __FUNCTION__);
                }
                return 1;
            }
            if (memcmp(aes_cbc_vec[k].input, aes_padded_ccm_output, (size_t)(aes_cbc_vec[k].il - 1)) != 0)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: short pad aes_cbc_decrypt data failed\n", __FUNCTION__);
                }
                return 1;
            }

            if( verbose != 0 )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "passed\n");
            }

            mbedtls_aes_free( &ctx );
        }

        if( verbose != 0 )
        {
            CY_WPS_DEBUG(( "\n" );
        }
    }


    /*
     * CTR mode
     */

    {
        int retv;
        uint32_t k;
        mbedtls_aes_context ctx;

        mbedtls_aes_init( &ctx );
        /* AES-CTR, full blocks */
        //    dbg(("%s: AES-CTR, full blocks\n", __FUNCTION__));
        for ( k = 0; k < (int)NUM_CTR_VECTORS; k++ )
        {
            mbedtls_aes_setkey_enc( &ctx, aes_ctr_vec[k].key, (uint32_t)( aes_ctr_vec[k].kl * 8 ) );
            retv = aes_crypt_ctr( &ctx,
                                  (uint32_t)aes_ctr_vec[k].il, aes_ctr_vec[k].nonce,
                                  aes_ctr_vec[k].input, aes_padded_ccm_output);
            if( verbose != 0 )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "AES CTR Encrypt: %d bytes\n", aes_ctr_vec[k].il);
            }

            if (retv)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ctr_crypt failed\n", __FUNCTION__);
                }
                return 1;
            }
            if ( memcmp( aes_padded_ccm_output, aes_ctr_vec[k].ref, (size_t) aes_ctr_vec[k].il ) != 0 )
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ctr_crypt encrypt failed\n", __FUNCTION__);
                }
                return 1;
            }

            mbedtls_aes_setkey_enc( &ctx, aes_ctr_vec[k].key, aes_ctr_vec[k].kl * 8);
            retv = aes_crypt_ctr( &ctx,
                                  aes_ctr_vec[k].il, aes_ctr_vec[k].nonce,
                                  aes_ctr_vec[k].ref, aes_padded_ccm_input2);
            if( verbose != 0 )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "AES CTR Decrypt: %d bytes\n", aes_ctr_vec[k].il );
            }

            if (retv)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ctr_crypt failed\n", __FUNCTION__);
                }
                return 1;
            }
            if (memcmp(aes_ctr_vec[k].input, aes_padded_ccm_input2, aes_ctr_vec[k].il) != 0)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ctr_crypt decrypt failed\n", __FUNCTION__);
                }
                return 1;
            }
        }

        /* AES-CTR, one partial block */
        //    dbg(("%s: AES-CTR, one partial block\n", __FUNCTION__));
        for (k = 0; k < NUM_CTR_VECTORS; k++)
        {
            mbedtls_aes_setkey_enc( &ctx, aes_ctr_vec[k].key, aes_ctr_vec[k].kl * 8);
            retv = aes_crypt_ctr( &ctx,
                                  k + 1, aes_ctr_vec[k].nonce,
                                  aes_ctr_vec[k].input, aes_padded_ccm_output);
            if( verbose != 0 )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "AES CTR Partial Block Encrypt: %d bytes\n", k + 1 );
            }

