Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_MBEDTLS/cy_wps_aes_ctr_ccm.c
            if (retv)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ctr_crypt failed\n", __FUNCTION__);
                }
                return 1;
            }
            if ( memcmp( aes_padded_ccm_output, aes_ctr_vec[k].ref, (size_t)( k + 1 ) ) != 0 )
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ctr_crypt encrypt failed\n", __FUNCTION__);
                }
                return 1;
            }

            mbedtls_aes_setkey_enc( &ctx, aes_ctr_vec[k].key, aes_ctr_vec[k].kl * 8);
            retv = aes_crypt_ctr( &ctx,
                                  k + 1, aes_ctr_vec[k].nonce,
                                  aes_ctr_vec[k].ref, aes_padded_ccm_input2);
            if( verbose != 0 )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "AES CTR Partial Block Decrypt: %d bytes\n", k + 1 );
            }

            if (retv)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ctr_crypt failed\n", __FUNCTION__);
                }
                return 1;
            }
            if (memcmp(aes_ctr_vec[k].input, aes_padded_ccm_input2, k + 1) != 0)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ctr_crypt decrypt failed\n", __FUNCTION__);
                }
                return 1;
            }
        }

        /* AES-CTR, multi-block partial */
        //    dbg(("%s: AES-CTR, multi-block partial\n", __FUNCTION__));
        for (k = 0; k < NUM_CTR_VECTORS; k++)
        {
            mbedtls_aes_setkey_enc( &ctx, aes_ctr_vec[k].key, aes_ctr_vec[k].kl * 8);
            retv = aes_crypt_ctr( &ctx,
                                  AES_BLOCK_SZ + NUM_CTR_VECTORS + k + 1, aes_ctr_vec[k].nonce,
                                  aes_ctr_vec[k].input, aes_padded_ccm_output);
            if( verbose != 0 )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "AES CTR Partial Multi-Block Encrypt: %d bytes\n",
                       AES_BLOCK_SZ + NUM_CTR_VECTORS + k + 1 );
            }

            if (retv)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ctr_crypt failed\n", __FUNCTION__);
                }
                return 1;
            }
            if (memcmp(aes_padded_ccm_output, aes_ctr_vec[k].ref, AES_BLOCK_SZ + NUM_CTR_VECTORS + k + 1) != 0)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ctr_crypt encrypt failed\n", __FUNCTION__);
                }
                return 1;
            }

            mbedtls_aes_setkey_enc( &ctx, aes_ctr_vec[k].key, aes_ctr_vec[k].kl * 8);
            retv = aes_crypt_ctr( &ctx,
                                  AES_BLOCK_SZ + NUM_CTR_VECTORS + k + 1, aes_ctr_vec[k].nonce,
                                  aes_ctr_vec[k].ref, aes_padded_ccm_input2);
            if( verbose != 0 )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "AES CTR Partial Multi-Block Decrypt: %d bytes\n",
                       AES_BLOCK_SZ + NUM_CTR_VECTORS + k + 1 );
            }

            if (retv)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ctr_crypt failed\n", __FUNCTION__);
                }
                return 1;
            }
            if (memcmp(aes_ctr_vec[k].input, aes_padded_ccm_input2,
                       AES_BLOCK_SZ + NUM_CTR_VECTORS + k + 1) != 0)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ctr_crypt decrypt failed\n", __FUNCTION__);
                }
                return 1;
            }
        }

        mbedtls_aes_free( &ctx );
    }

    /*
     * CCM mode
     */
    {
        unsigned char output[TESTBUF], input2[TESTBUF];
        int retv;
        uint32_t k;
        mbedtls_aes_context ctx;

        mbedtls_aes_init( &ctx );
        /* FIXME: add some failing decrypt cases */
        /* AES-CCM */
        //    dbg(("%s: AES-CCM\n", __FUNCTION__));
        for (k = 0; k < NUM_CCM_VECTORS; k++)
        {
            mbedtls_aes_setkey_enc( &ctx, aes_ccm_vec[k].key, aes_ccm_vec[k].kl * 8);
            retv = aes_ccm_mac( &ctx,
                                aes_ccm_vec[k].il, aes_ccm_vec[k].al,
                                aes_ccm_vec[k].nonce, aes_ccm_vec[k].nonce_len, aes_ccm_vec[k].aad,
                                aes_ccm_vec[k].input, output);

            if (retv)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ccm_mac failed\n", __FUNCTION__);
                }
                return 1;
            }
            if (memcmp(output, aes_ccm_vec[k].mac, AES_CCM_AUTH_LEN) != 0)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ccm_mac failed\n", __FUNCTION__);
                }
                return 1;
            }

            mbedtls_aes_setkey_enc( &ctx, aes_ccm_vec[k].key, aes_ccm_vec[k].kl * 8);
            retv = aes_encrypt_ccm( &ctx,
                                    aes_ccm_vec[k].il, aes_ccm_vec[k].al,
                                    aes_ccm_vec[k].nonce, aes_ccm_vec[k].nonce_len, aes_ccm_vec[k].aad,
                                    aes_ccm_vec[k].input, output, &output[aes_ccm_vec[k].il]);

            if( verbose != 0 )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "AES CCM Encrypt: %d bytes\n", aes_ccm_vec[k].il + AES_CCM_AUTH_LEN );
            }

