Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_MBEDTLS/cy_wps_aes_ctr_ccm.c
            if (retv)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ccm_encrypt failed\n", __FUNCTION__);
                }
                return 1;
            }
            if (memcmp(output, aes_ccm_vec[k].ref, aes_ccm_vec[k].il + AES_CCM_AUTH_LEN) != 0)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ccm_encrypt failed\n", __FUNCTION__);
                }
                return 1;
            }

            mbedtls_aes_setkey_enc( &ctx, aes_ccm_vec[k].key, aes_ccm_vec[k].kl * 8);
            retv = aes_decrypt_ccm( &ctx,
                                    aes_ccm_vec[k].il + AES_CCM_AUTH_LEN, aes_ccm_vec[k].al,
                                    aes_ccm_vec[k].nonce, aes_ccm_vec[k].nonce_len, aes_ccm_vec[k].aad,
                                    aes_ccm_vec[k].ref, input2);

            if( verbose != 0 )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "AES CCM Decrypt: %d bytes\n", aes_ccm_vec[k].il + AES_CCM_AUTH_LEN);
            }

            if (retv)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ccm_decrypt failed\n", __FUNCTION__);
                }
                return 1;
            }
            if (memcmp(aes_ccm_vec[k].input, input2, aes_ccm_vec[k].il) != 0)
            {
                if( verbose != 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s: aes_ccm_decrypt failed\n", __FUNCTION__);
                }
                return 1;
            }
        }

        mbedtls_aes_free( &ctx );
    }




    if (verbose != 0)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n");
    }

    return (0);
}

#endif
